finnurtorfa/nrf51/lib/nrf51sdk/Nordic/nrf51822/Source/ble/ble_dtm.c
/* Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#include "ble_dtm.h"
#include <stdbool.h>
#include <string.h>
#include "nrf.h"

#define DTM_HEADER_OFFSET               0                                                   /**< Index where the header of the pdu is located. */
#define DTM_HEADER_SIZE                 2                                                   /**< Size of PDU header. */
#define DTM_PAYLOAD_MAX_SIZE            37                                                  /**< Maximum payload size allowed during dtm execution. */
#define DTM_LENGTH_OFFSET               (DTM_HEADER_OFFSET + 1)                             /**< Index where the length of the payload is encoded. */
#define DTM_PDU_MAX_MEMORY_SIZE         (DTM_HEADER_SIZE + DTM_PAYLOAD_MAX_SIZE)            /**< Maximum PDU size allowed during dtm execution. */

#define RX_MODE                         true                                                /**< Constant defining RX mode for radio during dtm test. */
#define TX_MODE                         false                                               /**< Constant defining TX mode for radio during dtm test. */

#define PHYS_CH_MAX                     39                                                  /**< Maximum number of valid channels in BLE. */

// Values that for now are "constants" - they could be configured by a function setting them,
// but most of these are set by the BLE DTM standard, so changing them is not relevant.
#define RFPHY_TEST_0X0F_REF_PATTERN     0x0f                                                /**<  RF-PHY test packet patterns, for the repeated octet packets. */
#define RFPHY_TEST_0X55_REF_PATTERN     0x55                                                /**<  RF-PHY test packet patterns, for the repeated octet packets. */

#define PRBS9_CONTENT {0xff, 0xc1, 0xfb, 0xe8, 0x4c, 0x90, 0x72, 0x8b,  \
                       0xe7, 0xb3, 0x51, 0x89, 0x63, 0xab, 0x23, 0x23,  \
                       0x2,  0x84, 0x18, 0x72, 0xaa, 0x61, 0x2f, 0x3b,  \
                       0x51, 0xa8, 0xe5, 0x37, 0x49, 0xfb, 0xc9, 0xca,  \
                       0xc,  0x18, 0x53, 0x2c, 0xfd}                                        /**< The PRBS9 sequence used as packet payload. */

/**@brief Structure holding the PDU used for transmitting/receiving a PDU.
 */
typedef struct
{
    uint8_t content[DTM_HEADER_SIZE + DTM_PAYLOAD_MAX_SIZE];                                /**< PDU packet content. */
} pdu_type_t;

/**@brief States used for the DTM test implementation.
 */
typedef enum
{
    STATE_UNINITIALIZED,                                                                    /**< The DTM is uninitialized. */
    STATE_IDLE,                                                                             /**< State when system has just initialized, or current test has completed. */
    STATE_TRANSMITTER_TEST,                                                                 /**< State used when a DTM Transmission test is running. */
    STATE_CARRIER_TEST,                                                                     /**< State used when a DTM Carrier test is running (Vendor specific test). */
    STATE_RECEIVER_TEST                                                                     /**< State used when a DTM Receive test is running. */
} state_t;

// Internal variables set as side effects of commands or events.
static state_t                          m_state = STATE_UNINITIALIZED;                      /**< Current machine state. */
static uint16_t                         m_rx_pkt_count;                                     /**< Number of valid packets received. */
static pdu_type_t                       m_pdu;                                              /**< PDU to be sent. */
static uint16_t                         m_event;                                            /**< current command status - initially "ok", may be set if error detected, or to packet count. */
static bool                             m_new_event;                                        /**< Command has been processed - number of not yet reported event bytes. */
static uint8_t                          m_packet_length;                                    /**< Payload length of transmitted PDU, bits 2:7 of 16-bit dtm command. */
static dtm_pkt_type_t                   m_packet_type;                                      /**< Bits 0..1 of 16-bit transmit command, or 0xFFFFFFFF. */
static dtm_freq_t                       m_phys_ch;                                          /**< 0..39 physical channel number (base 2402 MHz, Interval 2 MHz), bits 8:13 of 16-bit dtm command. */
static uint32_t                         m_current_time = 0;                                 /**< Counter for interrupts from timer to ensure that the 2 bytes forming a DTM command are received within the time window. */

// Nordic specific configuration values (not defined by BLE standard).
// Definition of initial values found in ble_dtm.h
static int32_t                          m_tx_power          = DEFAULT_TX_POWER;             /**< TX power for transmission test, default to maximum value (+4 dBm). */
static NRF_TIMER_Type *                 mp_timer            = DEFAULT_TIMER;                /**< Timer to be used. */
static IRQn_Type                        m_timer_irq         = DEFAULT_TIMER_IRQn;           /**< which interrupt line to clear on every timeout */

static uint8_t const                    m_prbs_content[]    = PRBS9_CONTENT;                /**< Pseudo-random bit sequence defined by the BLE standard. */
static uint8_t                          m_packetHeaderLFlen = 8;                            /**< Length of length field in packet Header (in bits). */
static uint8_t                          m_packetHeaderS0len = 1;                            /**< Length of S0 field in packet Header (in bytes). */
static uint8_t                          m_packetHeaderS1len = 0;                            /**< Length of S1 field in packet Header (in bits). */
static uint8_t                          m_crcConfSkipAddr   = 1;                            /**< Leave packet address field out of CRC calculation. */
static uint8_t                          m_static_length     = 0;                            /**< Number of bytes sent in addition to the var.length payload. */
static uint32_t                         m_balen             = 3;                            /**< Base address length in bytes. */
static uint32_t                         m_endian            = RADIO_PCNF1_ENDIAN_Little;    /**< On air endianess of packet, this applies to the S0, LENGTH, S1 and the PAYLOAD fields. */
static uint32_t                         m_whitening         = RADIO_PCNF1_WHITEEN_Disabled; /**< Whitening disabled. */
static uint8_t                          m_crcLength         = RADIO_CRCCNF_LEN_Three;       /**< CRC Length (in bytes). */
static uint32_t                         m_address           = 0x71764129;                   /**< Address. */
static uint32_t                         m_crc_poly          = 0x0000065B;                   /**< CRC polynomial. */
static uint32_t                         m_crc_init          = 0x00555555;                   /**< Initial value for CRC calculation. */
static uint8_t                          m_radio_mode        = RADIO_MODE_MODE_Ble_1Mbit;    /**< nRF51 specific radio mode vale. */
static uint32_t                         m_txIntervaluS      = 625;                          /**< Time between start of Tx packets (in uS). */


